import setImg from '../images/complete-set.png';
import pistol from '../images/pistol.png';

// example name
export const websiteLink = 'https://krepdver';
export const websiteName = 'Крепеж для установки межкомнатных дверей в Москве';
export const webPageNotFoundName = '404 Not Found';

export const productsList = [{
  id: 1,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 2,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 3,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 4,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 5,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 6,
  type: 'complete-set',
  name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
  article: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
  notice: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
},
{
  id: 7,
  type: 'extra',
  name: 'Пистолет для пены Fomeron, Blast',
  article: '590004',
  price: 650,
  description: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
  descriptionList: [
    'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
    'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
    'Уникальная конструкция - регулировочный винт находится под большим пальцем, можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке).'
  ],
  img: pistol,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
},
{
  id: 8,
  type: 'extra',
  name: 'Пистолет для пены Fomeron, Blast',
  article: '590004',
  price: 650,
  description: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
  descriptionList: [
    'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
    'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
    'Уникальная конструкция - регулировочный винт находится под большим пальцем, можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке).'
  ],
  img: pistol,
  shortInfo: {
    type: 'Накладная дверь',
    size: 'Универсал',
  },
  propertyList: [
    'Установить межкомнатные двери можно легко и скрытно.',
   ' Вес дверей до 80 кг.',
    'Предупреждает распирание дверной коробки избыточным расширением монтажной пены ',
    'Сохраняется эстетичный вид дверной коробки без внешних повреждений. ',
    'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
    'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo: 'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
},];

export const productsRouters = productsList.map((item) => `/product/${item.id}`);
export const headerRouters = [
  '/',
];

export const footerRouters = [
  '/',
];
