import setImg from '../images/complete-set.png';
import pistol from '../images/pistol.png';

export const completeSetsList = [{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},
{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},
{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},
{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},
{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},
{
  name: 'МКС1-3Д',
  price: 650,
  description: 'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
  img: setImg,
},];

export const pistolsList = [{
  article: '590005',
  name: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
  description: [
    'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
    'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
    'Уникальная конструкция - регулировочный винт находится под большим пальцем - можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке),'
  ],
  price: 650,
  img: pistol,
},
{
  article: '590005',
  name: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
  description: [
    'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
    'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
    'Уникальная конструкция - регулировочный винт находится под большим пальцем - можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке),'
  ],
  price: 650,
  img: pistol,
},
];
