import setImg from '../images/complete-set.png';
import pistol from '../images/pistol.png';

/*
  ПРИМЕР КАРТЫ ТОВАРА

{
  id: уникальное число - на 1 выше предыдущего,
  type: 'complete-set/extra',
  name: 'имя',
  article: 'артикль',
  price: цена - только число,
  description:
    'описание - все предложения в одной строке',
  img: изображение,
  shortInfo: {
    type: 'тип',
    size: 'размер',
   },
   propertyList: [
    Список предложений - по свойству в каждую строку.
    Пример:
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo:
    'Содержимое упаковки с маленькой буквы, через запятую - в одной строке',
  feature:
     Если есть какая-то особенность' - в одной строке,
},

*/

/*

const emptyProductCard = {
  id: null,
  type: '',
  name: '',
  article: '',
  price: null,
  description:
    '',
  img: null,
  shortInfo: {
    type: '',
    size: '',
  },
  propertyList: [
    '',
    '',
    '',
    '',
    '',
    '',
  ],
  packageInfo:
    '',
  feature:
    '',
}

*/

export const productsList = [
  {
    id: 1,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 2,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 3,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 4,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 5,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 6,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 650,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: setImg,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature:
      'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель. В остальном они аналоги...',
  },
  {
    id: 7,
    type: 'extra',
    name: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
    article: '590004',
    price: 650,
    description: 'Пистолет для монтажной пены Fomeron Classic',
    descriptionList: [
      'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
      'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
      'Уникальная конструкция - регулировочный винт находится под большим пальцем, можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке).',
    ],
    img: pistol,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature: null,
  },
  {
    id: 8,
    type: 'extra',
    name: 'Fomeron - профессиональные пистолеты для монтажной пены PREMIUM-класса',
    article: '590004',
    price: 650,
    description: 'Пистолет для монтажной пены Fomeron Classic',
    descriptionList: [
      'Исключительная герметичность! Могут стоять с навинченным баллоном пены до 4х месяцев!',
      'Тефлоновые прокладки внутри не разъедаются ацетоном при промывке.',
      'Уникальная конструкция - регулировочный винт находится под большим пальцем, можно регулировать выход пены одной рукой, что особенно удобно при работе на высоте (например на стремянке).',
    ],
    img: pistol,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн монтажный малый - 6 шт., винт М6х60 с пресс-шайбой - 6 шт. гайка с буртом М6 - 6 шт., гайка низкая М6 - 6 шт., саморез по дереву - 12 шт., дюбель распорный 10х50 шипы-усы - 6 шт..',
    feature: null,
  },
];

export const productsRouters = productsList.map((item) => `/product/${item.id}`);
