import sk2 from '../images/products/img-sk2.jpg';
import sk3 from '../images/products/img-sk3.jpg';
import mkc13d from '../images/products/img-mkc1-3d.jpg';
import k10 from '../images/products/img-k1-0.jpg';
import k20 from '../images/products/img-k2-0.jpg';
import fomeronClassic from '../images/products/img-fomeron-classic.png';
import fomeronTop from '../images/products/img-fomeron-top.png';

/*
  ПРИМЕР КАРТЫ ТОВАРА

{
  id: уникальное число - на 1 выше предыдущего,
  type: 'complete-set/extra',
  name: 'имя', (Если с артиклем, то ставить его только в конец!)
  article: 'артикль',
  price: цена - только число,
  description:
    'описание - все предложения в одной строке',
  img: изображение,
  shortInfo: {
    type: 'тип',
    size: 'размер',
   },
   propertyList: [
    Список предложений - по свойству в каждую строку.
    Пример:
      'Установить межкомнатные двери можно легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупреждает распирание дверной коробки избыточным расширением монтажной пены',
      'Сохраняется эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюдается максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
  ],
  packageInfo:
    'Содержимое упаковки с маленькой буквы, через запятую - в одной строке',
  feature:
     Если есть какая-то особенность' - в одной строке,
},

*/

/*

const emptyProductCard = {
  id: null,
  type: '',
  name: '',
  article: '',
  price: null,
  description:
    '',
  img: null,
  shortInfo: {
    type: '',
    size: '',
  },
  propertyList: [
    '',
    '',
    '',
    '',
    '',
    '',
  ],
  packageInfo:
    '',
  feature:
    '',
}

*/

export const productsList = [
  {
    id: 1,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей СК-2',
    article: 'СК-2',
    price: 500,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: sk2,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Произвести скрытый монтаж межкомнатных дверей, изготовленных из массива дерева (весом до 80 кг).',
      'Взять дверную коробку в жесткий стальной каркас из шести кронштейнов без использования клиньев, подвесов и т.п.',
      'Предупредить распирание дверной коробки избыточным расширением монтажной пены.',
      'Сохранить первоначальный вид дверной коробки без внешних повреждений.',
      'Соблюсти максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., монтажная скоба - 6 шт., болт М6х60 - 6 шт., гайка с буртом  М6 - 6 шт., дюбель распорный 10х50 шипы-усы - 6 шт., саморез по дереву - 6 шт., увеличенная шайба М4 - 6 шт..',
    feature:
      'В отличие от других монтажных комплектов снижен технологический зазор между дверной коробкой и стеной проёма до 10-40 мм (против 16-40 мм в монтажных комплектах СМС). Перед монтажом необходимо убедиться в наличии у мастера двух ключ-насадок шестигранных на 8 и 10 мм а также ключей рожковых на 8 и 10 мм',
  },
  {
    id: 2,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей СК-3',
    article: 'СК-3',
    price: 500,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях! Улучшенный прототип К-2.0.',
    img: sk3,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Произвести надежный скрытый монтаж межкомнатных дверей (весом до 80 кг).',
      'Взять дверную коробку в жесткий стальной каркас без использования клиньев, подвесов и т.п..',
      'Предупредить распирание дверной коробки избыточным расширением монтажной пены.',
      'Сохранить первоначальный вид дверной коробки без внешних повреждений.',
      'Соблюсти максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo: '',
    feature:
      'В отличие от других монтажных комплектов снижен технологический зазор между дверной коробкой и стеной проёма до 10 мм (против 16 мм в монтажных комплектах СМС). Перед монтажом необходимо убедиться в наличии у мастера двух ключ-насадок шестигранных на 8 и 10 мм а также ключей рожковых на 8 и 10 мм',
  },
  {
    id: 3,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей МКС1-3Д',
    article: 'МКС1-3Д',
    price: 500,
    description:
      'Комплект крепежа для установки дверей весом полотна до 80 кг с возможностью легкой регулировки коробки в 3D плоскостях!',
    img: mkc13d,
    shortInfo: {
      type: 'Накладная дверь',
      size: 'Универсал',
    },
    propertyList: [
      'Установить межкомнатные двери легко и скрытно.',
      'Вес дверей до 80 кг.',
      'Предупредить распирание дверной коробки избыточным расширением монтажной пены.',
      'Сохранить эстетичный вид дверной коробки без внешних повреждений.',
      'Соблюсти максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'ВАЖНО! Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., монтажная скоба - 6 шт., болт 6x60 - 6 шт., гайка с буртом М6 - 6 шт., дюбель распорный 10х50 шипы-усы - 6 шт., саморез по дереву - 12 шт., шайба под саморез - 12 шт..',
    feature: 'Отличие от СК-1 - два пропила в плавающем кронштейне, другой производитель.',
  },
  {
    id: 4,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей СМС К-1.0',
    article: 'СМС К-1.0',
    price: 480,
    description: 'Удобен при монтаже межкомнатных дверей с весом полотна до 50 кг.',
    img: k10,
    shortInfo: {
      type: 'Стандарт',
      size: 'Универсал',
    },
    propertyList: [
      'Произвести скрытый монтаж межкомнатных дверей.',
      'Закрепить дверную коробку без повреждения.',
      'Жестко закрепить дверную коробку в проеме в шести точках.',
      'Соблюсти максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
    ],
    packageInfo:
      'инструкция - 1 шт., кронштейн - 6 шт., винт - 6 шт., гайка М6 - 12 шт., дюбель распорный 10х50 - 6 шт., саморез 12мм - 12 шт..',
    feature: null,
  },
  {
    id: 5,
    type: 'complete-set',
    name: 'Монтажный комплект для установки межкомнатных дверей СМС К-2.0',
    article: 'СМС К-2.0',
    price: 500,
    description:
      'Усиленный комплект для установки межкомнатных дверей из массива дерева, дубовых и тяжелых дверей до 80 кг. Кронштейны изготовлены из стали 2 мм.',
    img: k20,
    shortInfo: {
      type: 'Спец',
      size: 'Универсал',
    },
    propertyList: [
      'Произвести надежную и скрытую установку любых межкомнатных дверей.',
      'Закрепить дверную коробку без повреждения. ',
      'Жестко закрепить дверную коробку в проеме в шести точках.',
      'Соблюсти максимальную точность при выставлении зазоров между полотном и дверной коробкой.',
      'Можно пользоваться дверью непосредственно после монтажа, не дожидаясь полного высыхания монтажной пены.',
      'Отлично подходит для дубовых дверей и тяжелых дверей до 80 кг.',
    ],
    packageInfo:
      'инструкция - 1 шт., большой кронштейн - 6 шт., болт 6x60  с пресс-шайбой - 6 шт., гайка с буртом М6 - 6 шт., дюбель распорный 10х50 - 6 шт., 3,9х16 шестигр. с головкой под ключ - 12 шт., гайка с буртом М6.',
    feature:
      'Усиленные кронштейны из стали 2 мм - позволяют регулировать дверной блок в 3х плоскостях. Специальные гайки с буртом, насечки которой усиливают эффект фиксации, что исключает ослабление крепежа при регулировке соседних крепежных узлов. Саморезы 3,9х16 шестигр. с головкой под ключ 8 мм, более жесткое крепление кронштейна к коробке',
  },
  {
    id: 6,
    type: 'extra',
    name: 'Пистолет для монтажной пены Fomeron Classic',
    article: '590005',
    price: 1200,
    description: 'Уникальная форма и система герметизации!',
    descriptionList: [
      'Отсутсвуют резиновые прокладки в наконечнике!',
      'Регулировочный винт находится между рукояткой и курком.',
      'Может храниться с навинченным балоном с пеной до 4-х месяцев!',
    ],
    img: fomeronClassic,
    shortInfo: {
      type: 'Classic',
      size: 'Универсал',
    },
    propertyList: [
      'Отсутсвуют резиновые прокладки в наконечнике!',
      'Регулировочный винт находится между рукояткой и курком.',
      'Может храниться с навинченным балоном с пеной до 4-ч месяцев!',
      'Эргономичная кукоятка из ударопрочн. пластика.',
      'Устойчив ко всем ацетоновым промывочным жидкостям! ',
      'Долговечен.',
    ],
    packageInfo: 'Пистолет для монтажной пены - 1 шт',
    feature: null,
  },
  {
    id: 7,
    type: 'extra',
    name: 'Пистолет для монтажной пены Fomeron Top',
    article: '590007',
    price: 1950,
    description: 'Пистолет PREMIUM-класса!',
    descriptionList: [
      'Полностью покрыт тефлоном! Даже застывшая пена легко удаляется руками со всех элементов пистолета!',
      'Регулировочный винт находится между рукояткой и курком.',
      'Тефлон защищает резиновые от разъедания ацетоном, резиновые закрывают систему от завоздушивания.',
    ],
    img: fomeronTop,
    shortInfo: {
      type: 'Top',
      size: 'Универсал',
    },
    propertyList: [
      'Уникальная форма и система герметизации!',
      'Отсутсвуют резиновые прокладки в наконечнике!',
      'Пистолет PREMIUM-класса!',
      'Регулировочный винт находится между рукояткой и курком.',
      'Может храниться с навинченным балоном с пеной до 4-х месяцев!',
    ],
    packageInfo: 'Пистолет для монтажной пены - 1 шт',
    feature:
      'В отличие от моделей Fomeron Classic: полностью покрыт тефлоном! Даже застывшая пена легко удаляется руками без химии со всех элементов пистолета!',
  },
];

export const productsRouters = productsList.map((item) => `/product/${item.id}`);
